## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.sentinel_service will be updated in-place
  ~ resource "aws_ecs_service" "sentinel_service" {
        id                                 = "arn:aws:ecs:eu-west-1:608859220822:service/sentinel-cluster/sentinel-service"
        name                               = "sentinel-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-west-1:608859220822:task-definition/sentinel-task:16" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.sentinel_task must be replaced
-/+ resource "aws_ecs_task_definition" "sentinel_task" {
      ~ arn                      = "arn:aws:ecs:eu-west-1:608859220822:task-definition/sentinel-task:16" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-west-1:608859220822:task-definition/sentinel-task" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "DB_PATH"
                          - value = "data/db.sqlite"
                        },
                      - {
                          - name  = "METRICS_PORT"
                          - value = "9100"
                        },
                      - {
                          - name  = "NODE_ENV"
                          - value = "production"
                        },
                    ]
                  - essential        = true
                  - image            = "608859220822.dkr.ecr.eu-west-1.amazonaws.com/sentinel:latest"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/ecs/sentinel-service"
                          - awslogs-region        = "eu-west-1"
                          - awslogs-stream-prefix = "sentinel"
                        }
                    }
                  - mountPoints      = []
                  - name             = "sentinel-container"
                  - portMappings     = [
                      - {
                          - containerPort = 9100
                          - hostPort      = 9100
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "HTTP_RPC_NODE"
                          - valueFrom = "arn:aws:secretsmanager:eu-west-1:608859220822:secret:sentinel-secret-ShE4FA:HTTP_RPC_NODE::"
                        },
                      - {
                          - name      = "PRIVATE_KEY"
                          - valueFrom = "arn:aws:secretsmanager:eu-west-1:608859220822:secret:sentinel-secret-ShE4FA:PRIVATE_KEY::"
                        },
                    ]
                  - volumesFrom      = []
                },
            ] # forces replacement
        ) -> (known after apply) # forces replacement
      ~ id                       = "sentinel-task" -> (known after apply)
      ~ revision                 = 16 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # aws_efs_file_system.sentinel_efs will be created
  + resource "aws_efs_file_system" "sentinel_efs" {
      + arn                     = (known after apply)
      + availability_zone_id    = (known after apply)
      + availability_zone_name  = (known after apply)
      + creation_token          = "sentinel-efs"
      + dns_name                = (known after apply)
      + encrypted               = (known after apply)
      + id                      = (known after apply)
      + kms_key_id              = (known after apply)
      + number_of_mount_targets = (known after apply)
      + owner_id                = (known after apply)
      + performance_mode        = (known after apply)
      + size_in_bytes           = (known after apply)
      + tags_all                = (known after apply)
      + throughput_mode         = "bursting"
    }

  # aws_efs_mount_target.sentinel_efs_mount_target will be created
  + resource "aws_efs_mount_target" "sentinel_efs_mount_target" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = (known after apply)
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = (known after apply)
      + subnet_id              = "subnet-090dfd45beffb7486"
    }

  # aws_security_group.sentinel_efs_sg will be created
  + resource "aws_security_group" "sentinel_efs_sg" {
      + arn                    = (known after apply)
      + description            = "Security group for Sentinel EFS"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "sentinel-efs-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-056d05666a5998eab"
    }

  # aws_security_group_rule.sentinel_efs_sg_ingress will be created
  + resource "aws_security_group_rule" "sentinel_efs_sg_ingress" {
      + from_port                = 2049
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-081812c273c8df33d"
      + to_port                  = 2049
      + type                     = "ingress"
    }

Plan: 5 to add, 1 to change, 1 to destroy.
```
</details>